Revit 2024 API
FailureMessageAccessor.GetFailureDefinitionId Method
 Retrieves the Id of the FailureDefinition of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FailureDefinitionId GetFailureDefinitionId()
Visual Basic
Public Function GetFailureDefinitionId As FailureDefinitionId
Visual C++
public:
FailureDefinitionId^ GetFailureDefinitionId()
Return Value
 The Id of the FailureDefinition of the failure.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace